Reports/РасчетКРПоЗадачамППЛО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Report>
		<Properties>
			<Name>РасчетКРПоЗадачамППЛО</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ПлановыеПоказателиСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПлановыеПоказателиСметы</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтавкаРКО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ДокументУТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ДокументУТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БонусыПоАктам</xr:Item>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовУТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КоммерческоеВознаграждение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗадачаПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВознаграждения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОбеспечено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоСмете</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вручную</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СметаЗадачиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СметаЗадачиПроекта</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конвертирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Документы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВключитьВСмету</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиСметы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИзмененоДокументом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Итоговая</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/РасчетКРПоЗадачамППЛО/Ext/ObjectModule.bsl
Функция ВернутьТаблицуКР(Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УТ_КВ.Ссылка.Контрагент,
		|	УТ_КВ.Ссылка.Менеджер,
		|	УТ_КВ.ЗадачаПроекта,
		|	СУММА(УТ_КВ.Сумма),
		|	УТ_КВ.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи КАК ВидТЗ,
		|	УТ_КВ.ЗадачаПроекта.ТиповаяЗадача КАК ТиповаяЗадача,
		|	УТ_КВ.Ссылка КАК Акт,
		|	УТ_КВ.ЗадачаПроекта.Владелец.ГодПроекта КАК ГодПроекта
		|ПОМЕСТИТЬ ВТ_Акты
		|ИЗ
		|	Документ.ДокументУТ.КоммерческоеВознаграждение КАК УТ_КВ
		|ГДЕ
		|	УТ_КВ.Ссылка.Проведен
		|	И УТ_КВ.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И УТ_КВ.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи В(&ВидТЗ)
		|
		|СГРУППИРОВАТЬ ПО
		|	УТ_КВ.Ссылка,
		|	УТ_КВ.ЗадачаПроекта,
		|	УТ_КВ.Ссылка.Контрагент,
		|	УТ_КВ.Ссылка.Менеджер,
		|	УТ_КВ.ЗадачаПроекта.ТиповаяЗадача.ВидТиповойЗадачи,
		|	УТ_КВ.ЗадачаПроекта.ТиповаяЗадача,
		|	УТ_КВ.ЗадачаПроекта.Владелец.ГодПроекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СметаЗадачиПроекта.Расчет.(
		|		Ссылка,
		|		НомерСтроки,
		|		КодСтатьи,
		|		ИмяСтатьи,
		|		Статья,
		|		ЗначениеПараметра,
		|		Сумма,
		|		ИзмененоДокументом,
		|		Итоговая
		|	),
		|	СметаЗадачиПроекта.Ссылка КАК СметаЗадачиПроекта,
		|	ВТ_Акты.Контрагент,
		|	ВТ_Акты.Менеджер,
		|	ВТ_Акты.ЗадачаПроекта,
		|	ВТ_Акты.Сумма,
		|	ВТ_Акты.ВидТЗ,
		|	ВТ_Акты.ТиповаяЗадача,
		|	ВТ_Акты.Акт,
		|	ВТ_Акты.ГодПроекта
		|ИЗ
		|	ВТ_Акты КАК ВТ_Акты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СметаЗадачиПроекта КАК СметаЗадачиПроекта
		|		ПО ВТ_Акты.ЗадачаПроекта = СметаЗадачиПроекта.ЗадачаПроекта";

	МассивВидовТЗ = Новый Массив;
	МассивВидовТЗ.Добавить( Справочники.ВидыТиповыхЗадач.НайтиПоНаименованию("ПП (ЛО)"));
		
	Запрос.УстановитьПараметр("ДатаНачала", 	Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВидТЗ",			МассивВидовТЗ );		
	//Запрос.УстановитьПараметр("ГодПроекта",		2014 );		

	Результат = Запрос.Выполнить().Выгрузить();
	
	// данные из сметы задачи проекта
	Результат.Колонки.Добавить("П_ВознПоср", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,3))); // 5
	Результат.Колонки.Добавить("СуммаНаклРасходы", 	Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Результат.Колонки.Добавить("СуммаРКО_НР", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Результат.Колонки.Добавить("П_Вендору", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,3))); 
	Результат.Колонки.Добавить("СуммаВендору", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Результат.Колонки.Добавить("СуммаБазаКР", 		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Результат.Колонки.Добавить("П_КР", 				Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7,3))); 
	Результат.Колонки.Добавить("СуммаКР", 			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	// производные колонки
	
	// 
	КоэффРКО = РегистрыСведений.ПлановыеПоказателиСметы.ПолучитьПоследнее( Период.ДатаНачала ).СтавкаРКО;
	Для Каждого СтрР ИЗ Результат Цикл
		СтрППЛО 	=  СтрР.Расчет.Найти( Справочники.СтатьиСметы.РасходыППЛО, 			"Статья");
		СтрДохФин 	=  СтрР.Расчет.Найти( Справочники.СтатьиСметы.ДохФинансовые, 		"Статья");
		СтрВознПоср	=  СтрР.Расчет.Найти( Справочники.СтатьиСметы.ВознагрПосредника, 	"Статья");
		СтрВознКМ	=  СтрР.Расчет.Найти( Справочники.СтатьиСметы.ВознаграждениеКМ, 	"Статья");
		
		// производные статьи
		// 5
		СтрР.П_ВознПоср 		= СтрВознПоср.ЗначениеПараметра;
		// 6
		СтрР.СуммаНаклРасходы 	= Окр( СтрР.П_ВознПоср * СтрР.Сумма / 100, 2);
		// 7
		СтрР.СуммаРКО_НР 		= Окр( СтрР.СуммаНаклРасходы * КоэффРКО / 100, 2);
		// 8
		СтрР.П_Вендору			= ?( СтрДохФин.Сумма = 0, 0,
									 Окр(СтрППЛО.Сумма/СтрДохФин.Сумма*100,3));							 
		// 9
		СтрР.СуммаВендору		= Окр( СтрР.П_Вендору * СтрР.Сумма / 100, 2);
		// 10 
		СтрР.СуммаБазаКР		= СтрР.Сумма - 
								  СтрР.СуммаНаклРасходы -
								  СтрР.СуммаРКО_НР - 
								  СтрР.СуммаВендору;
		// 11
		СтрР.П_КР				= СтрВознКМ.ЗначениеПараметра;
		//
		СтрР.СуммаКР			= Окр( СтрР.СуммаБазаКР * СтрР.П_КР / 100, 2);
											  
								  
	КонецЦикла;
	
	Возврат Результат;
КонецФункции


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//
	НастройкиСКД		= КомпоновщикНастроек.ПолучитьНастройки();
	
	//Получение самой СКД из макета
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	//
	
	
	//Макет компоновки
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиСКД, ДанныеРасшифровки );
	
	// параметры из СКД
	ПериодОтчета		= МакетКомпоновки.ЗначенияПараметров.Период.Значение;
	//Связь между таблицей значений и именами в СКД
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("РасчетКР", ВернутьТаблицуКР(ПериодОтчета));
	
	
	//Компоновка данных
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);

	//Вывод результата
	ДокументРезультат.Очистить(); 
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

	//ДокументРезультат = Новый ТабличныйДокумент;
	ДокументРезультат.АвтоМасштаб=Истина;
	ДокументРезультат.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	
КонецПроцедуры
